app/controllers/api/v1/portfolio_controller.rb

			def show
				@portfolio = Portfolio.find_by(id: params[:id])
---
SELECT  "portfolios".* FROM "portfolios"  WHERE "portfolios"."id" = 1 LIMIT 1